"""GC-состав является важной характеристикой геномных последовательностей и определяется как процентное соотношение
суммы всех гуанинов и цитозинов к общему числу нуклеиновых оснований в геномной последовательности.

Напишите программу, которая вычисляет процентное содержание символов G (гуанин) и C (цитозин) в введенной строке (
программа не должна зависеть от регистра вводимых символов).

Например, в строке "acggtgttat" процентное содержание символов G и C равно \dfrac4{10} \cdot 100 = 40.0 
10
4
​	
 ⋅100=40.0, где 4 -- это количество символов G и C,  а 10 -- это длина строки.

Sample Input:

acggtgttat
Sample Output:

40.0
"""
s = input()
C = s.upper().count("C".upper())
G = s.upper().count("G".upper())
a = (C + G) / len(s) * 100
print(a)